released/M480BSP_HSUSBD_HID_MultiDevice/SampleCode/Template/descriptors.c
    LEN_ENDPOINT,                           /*bLength: Endpoint Descriptor size*/
    DESC_ENDPOINT,                          /*bDescriptorType */
    (VENDOR02_INT_IN_EP_NUM | EP_INPUT),       /*bEndpointAddress: Endpoint Address (IN)*/
    EP_INT,                                 /*bmAttributes: Interrupt endpoint*/
    EPE_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPE_MAX_PKT_SIZE & 0xFF00) >> 8),
    VENDOR02_INT_IN_INTERVAL,                 /* bInterval */
    
	LEN_ENDPOINT,                           /* bLength: Endpoint Descriptor size */
    DESC_ENDPOINT,                          /* bDescriptorType */
    (VENDOR02_INT_OT_EP_NUM | EP_OUTPUT),   /*bEndpointAddress: Endpoint Address (OUT)*/
    EP_INT,                                 /* bmAttributes: Interrupt endpoint */
    EPF_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPF_MAX_PKT_SIZE & 0xFF00) >> 8),
    VENDOR02_INT_OT_INTERVAL,               /* bInterval */
};

//
// Other Config Descriptor for Full-speed
//
uint8_t gu8OtherConfigDescriptorFS[] __attribute__((aligned(4))) = {
    LEN_CONFIG,                             /* bLength: Configuration Descriptor size */
    DESC_CONFIG,                            /* bDescriptorType: Configuration */
    LEN_CONFIG_AND_SUBORDINATE & 0x00FF,    /* wTotalLength */
    ((LEN_CONFIG_AND_SUBORDINATE & 0xFF00) >> 8),
    INTERFACE_NUM,                          /*bNumInterfaces: Number of Interface count*/
    0x01,                                   /*bConfigurationValue: Configuration value*/
    0x00,                                   /*iConfiguration: Index of string descriptor describing the configuration*/
    0x80 | (USBD_SELF_POWERED << 6) | (USBD_REMOTE_WAKEUP << 5), /*bmAttributes: bus powered and Support Remote Wake-up */
    USBD_MAX_POWER,                         /*MaxPower 500 mA: this current is used for detecting Vbus*/
    /* 9 */

    /****************** Descriptor of interface *********************/
    LEN_INTERFACE,                          /*bLength: Interface Descriptor size*/
    DESC_INTERFACE,                         /*bDescriptorType: Interface descriptor type*/
    INTERFACE_1,                            /*bInterfaceNumber: Number of Interface*/
    0x00,                                   /*bAlternateSetting: Alternate setting*/
    INTERFACE_1_EP_CNT,                     /*bNumEndpoints*/
    0x03,                                   /*bInterfaceClass: CUSTOM_HID*/
    0x01,                                   /*bInterfaceSubClass : 1=Support Boot, 0=No Boot*/
    HID_KEYBOARD,                           /*nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse*/
    0x00,                                   /*iInterface: Index of string descriptor*/

    /******************** Descriptor of HID *************************/
    LEN_HID,                                /*bLength: CUSTOM_HID Descriptor size*/
    DESC_HID,                               /*bDescriptorType: CUSTOM_HID*/
    0x11,                                   /*bCUSTOM_HIDUSTOM_HID: CUSTOM_HID Class Spec release number*/
    0x01,
    0x00,                                   /*bCountryCode: Hardware target country*/
    0x01,                                   /*bNumDescriptors: Number of CUSTOM_HID class descriptors to follow*/
    DESC_HID_RPT,                           /*bDescriptorType*/
    sizeof(HID_Keyboard_ReportDescriptor) & 0x00FF, /* Total length of report descriptor. */
    ((sizeof(HID_Keyboard_ReportDescriptor) & 0xFF00) >> 8),

    /******************** Descriptor of endpoint ********************/
    LEN_ENDPOINT,                           /*bLength: Endpoint Descriptor size*/
    DESC_ENDPOINT,                          /*bDescriptorType */
    (KB_INT_IN_EP_NUM | EP_INPUT),    /*bEndpointAddress: Endpoint Address (IN)*/
    EP_INT,                                 /*bmAttributes: Interrupt endpoint*/
    EPA_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPA_MAX_PKT_SIZE & 0xFF00) >> 8),
    KB_INT_IN_INTERVAL,               /* bInterval */
    
    LEN_ENDPOINT,                           /* bLength: Endpoint Descriptor size */
    DESC_ENDPOINT,                          /* bDescriptorType */
    (KB_INT_OT_EP_NUM | EP_OUTPUT),   /*bEndpointAddress: Endpoint Address (OUT)*/
    EP_INT,                                 /* bmAttributes: Interrupt endpoint */
    EPB_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPB_MAX_PKT_SIZE & 0xFF00) >> 8),
    KB_INT_OT_INTERVAL,               /* bInterval */

    /************** Descriptor of interface ****************/
    LEN_INTERFACE,                          /*bLength: Interface Descriptor size*/
    DESC_INTERFACE,                         /*bDescriptorType: Interface descriptor type*/
    INTERFACE_2,                            /*bInterfaceNumber: Number of Interface*/
    0x00,                                   /*bAlternateSetting: Alternate setting*/
    INTERFACE_2_EP_CNT,                     /*bNumEndpoints*/
    0x03,                                   /*bInterfaceClass: HID*/
    0x01,                                   /*bInterfaceSubClass : 1=BOOT, 0=no boot*/
    HID_MOUSE,                              /*nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse*/
    0x00,                                   /*iInterface: Index of string descriptor*/

    /******************** Descriptor of HID ********************/
    LEN_HID,                                /*bLength: HID Descriptor size*/
    DESC_HID,                               /*bDescriptorType: HID*/
    0x10,                                   /*bCUSTOM_HIDUSTOM_HID: CUSTOM_HID Class Spec release number*/
    0x01,
    0x00,                                   /*bCountryCode: Hardware target country*/
    0x01,                                   /*bNumDescriptors: Number of HID class descriptors to follow*/
    DESC_HID_RPT,                           /*bDescriptorType*/
    sizeof(HID_Mouse_ReportDescriptor) & 0x00FF, /* Total length of report descriptor. */
    ((sizeof(HID_Mouse_ReportDescriptor) & 0xFF00) >> 8),

    /******************** Descriptor of endpoint ********************/
    LEN_ENDPOINT,                           /*bLength: Endpoint Descriptor size*/
    DESC_ENDPOINT,                          /*bDescriptorType:*/
    (MOUSE_INT_IN_EP_NUM | EP_INPUT),         /*bEndpointAddress: Endpoint Address (IN)*/
    EP_INT,                                 /*bmAttributes: Interrupt endpoint*/
    EPC_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPC_MAX_PKT_SIZE & 0xFF00) >> 8),
    MOUSE_INT_IN_INTERVAL,                    /*bInterval: Polling Interval (1 ms)*/

    /****************** Descriptor of interface *********************/
    LEN_INTERFACE,                          /*bLength: Interface Descriptor size*/
    DESC_INTERFACE,                         /*bDescriptorType: Interface descriptor type*/
    INTERFACE_3,                            /*bInterfaceNumber: Number of Interface*/
    0x00,                                   /*bAlternateSetting: Alternate setting*/
    INTERFACE_3_EP_CNT,                     /*bNumEndpoints*/
    0x03,                                   /*bInterfaceClass: HID*/
    0x00,                                   /*bInterfaceSubClass : 1=Support Boot, 0=No boot*/
    HID_NONE,                               /*nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse*/
    0x00,                                   /*iInterface: Index of string descriptor*/

    /******************** Descriptor of HID *************************/
    LEN_HID,                                /*bLength: HID Descriptor size*/
    DESC_HID,                               /*bDescriptorType: HID*/
    0x11,                                   /*bcdHID: HID Class Spec release number*/
    0x01,
    0x00,                                   /*bCountryCode: Hardware target country*/
    0x01,                                   /*bNumDescriptors: Number of HID class descriptors to follow*/
    DESC_HID_RPT,                           /*bDescriptorType*/
    sizeof(HID_Vendorpage1_ReportDescriptor) & 0x00FF, /* Total length of report descriptor. */
    ((sizeof(HID_Vendorpage1_ReportDescriptor) & 0xFF00) >> 8),

    /******************** Descriptor of endpoint ********************/
    LEN_ENDPOINT,                           /*bLength: Endpoint Descriptor size*/
    DESC_ENDPOINT,                          /*bDescriptorType */
    (VENDOR01_INT_IN_EP_NUM | EP_INPUT),       /*bEndpointAddress: Endpoint Address (IN)*/
    EP_INT,                                 /*bmAttributes: Interrupt endpoint*/
    EPD_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPD_MAX_PKT_SIZE & 0xFF00) >> 8),
    VENDOR01_INT_IN_INTERVAL,                 /* bInterval */
    
    /*-------------------    #ifc4:Custom#    -------------------------*/
    LEN_INTERFACE,                  /*bLength: Interface Descriptor size*/
    DESC_INTERFACE,                 /*bDescriptorType: Interface descriptor type*/
    INTERFACE_4,                    /*bInterfaceNumber: Number of Interface*/
    0x00,                           /*bAlternateSetting: Alternate setting*/
    INTERFACE_4_EP_CNT,             /*bNumEndpoints*/
    0x03,                           /*bInterfaceClass: CUSTOM_HID*/
    0x00,                           /*bInterfaceSubClass : 1=Support Boot, 0=No Boot*/
    HID_NONE,                       /*nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse*/
    0x00,                           /*iInterface: Index of string descriptor*/

    LEN_HID,                        /*bLength: CUSTOM_HID Descriptor size*/
    DESC_HID,                       /*bDescriptorType: CUSTOM_HID*/
    0x11,                           /*bCUSTOM_HIDUSTOM_HID: CUSTOM_HID Class Spec release number*/
    0x01,
    0x00,                           /*bCountryCode: Hardware target country*/
    0x01,                           /*bNumDescriptors: Number of CUSTOM_HID class descriptors to follow*/
    DESC_HID_RPT,                   /*bDescriptorType*/
    sizeof(HID_Vendorpge2_ReportDescriptor) & 0x00FF, /* wItemLength: Total length of Report descriptor*/
    ((sizeof(HID_Vendorpge2_ReportDescriptor) & 0xFF00) >> 8),

