released/M480BSP_HSUSBD_HID_MultiDevice/SampleCode/Template/descriptors.c
    LEN_ENDPOINT,                           /*bLength: Endpoint Descriptor size*/
    DESC_ENDPOINT,                          /*bDescriptorType */
    (VENDOR02_INT_IN_EP_NUM | EP_INPUT),       /*bEndpointAddress: Endpoint Address (IN)*/
    EP_INT,                                 /*bmAttributes: Interrupt endpoint*/
    EPE_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPE_MAX_PKT_SIZE & 0xFF00) >> 8),
    VENDOR02_INT_IN_INTERVAL,                 /* bInterval */
    
	LEN_ENDPOINT,                           /* bLength: Endpoint Descriptor size */
    DESC_ENDPOINT,                          /* bDescriptorType */
    (VENDOR02_INT_OT_EP_NUM | EP_OUTPUT),   /*bEndpointAddress: Endpoint Address (OUT)*/
    EP_INT,                                 /* bmAttributes: Interrupt endpoint */
    EPF_MAX_PKT_SIZE & 0x00FF,              /* wMaxPacketSize*/
    ((EPF_MAX_PKT_SIZE & 0xFF00) >> 8),
    VENDOR02_INT_OT_INTERVAL,               /* bInterval */
};

//
// USB HID Report Descriptor
//
uint8_t *gu8UsbHidReport[4] = {
    HID_Keyboard_ReportDescriptor,
    HID_Mouse_ReportDescriptor,
    HID_Vendorpage1_ReportDescriptor,
    HID_Vendorpge2_ReportDescriptor,
};

//
// HID Report Descriptor Length
//
uint32_t gu32UsbHidReportLen[4] = {
    sizeof(HID_Keyboard_ReportDescriptor),
    sizeof(HID_Mouse_ReportDescriptor),
    sizeof(HID_Vendorpage1_ReportDescriptor),
    sizeof(HID_Vendorpge2_ReportDescriptor),     
};

//
// Config HID Descriptor Index
//
uint32_t gu32ConfigHidDescIdx[4] =
{
    (LEN_CONFIG + LEN_INTERFACE),
    (sizeof(gu8ConfigDescriptor) - LEN_HID*1 - LEN_ENDPOINT*2),
    (sizeof(gu8ConfigDescriptor) - LEN_HID*2 - LEN_ENDPOINT*2),
    (sizeof(gu8ConfigDescriptor) - LEN_HID*3 - LEN_ENDPOINT*2),
};

//
// USB String
//
uint8_t *gpu8UsbString[4] = {
    gu8StringLang,
    gu8VendorStringDesc,
    gu8ProductStringDesc,
    NULL,
};

S_HSUSBD_INFO_T gsHSInfo = {
    gu8DeviceDescriptor,
    gu8ConfigDescriptor,
    gpu8UsbString,
    gu8QualifierDescriptor,
    gu8ConfigDescriptorFS,
    gu8OtherConfigDescriptorHS,
    gu8OtherConfigDescriptorFS,
    gu8UsbHidReport,
    gu32UsbHidReportLen,
    gu32ConfigHidDescIdx,
};
